.config/doom/config.org
#+TITLE: Config
#+AUTHOR: David Petti

* TABLE OF CONTENTS :toc:
- [[#basic-doom-config][Basic DOOM Config]]
- [[#latex-config][LaTeX Config]]
- [[#org-config][Org Config]]
  - [[#agenda][Agenda]]
  - [[#roam][Roam]]
- [[#treemacs-config][Treemacs Config]]
- [[#vterm-config][VTerm Config]]

* Basic DOOM Config

#+begin_src emacs-lisp
(setq doom-theme 'doom-gruvbox)
(setq display-line-numbers-type 'relative)
(setq scroll-margin 8)
;; (doom/set-frame-opacity 60)
#+end_src

* LaTeX Config

#+begin_src emacs-lisp
(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-source-correlate-start-server t)
(add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)

(map! :leader
      :desc "Latex Complie and view" "\ l" #'TeX-command-run-all)
#+end_src

* Org Config

#+begin_src emacs-lisp
(after! org
  (setq org-directory "~/org")
)
#+end_src

** Agenda

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files '("~/org/agenda.org")))

(setq
   ;; org-fancy-priorities-list '("[A]" "[B]" "[C]")
   ;; org-fancy-priorities-list '("❗" "[B]" "[C]")
   ;; org-fancy-priorities-list '("🟥" "🟧" "🟨")
   org-priority-faces
   '((?A :foreground "#ff6c6b" :weight bold)
     (?B :foreground "#98be65" :weight bold)
     (?C :foreground "#c678dd" :weight bold))
   org-agenda-block-separator 8411)

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Medium-priority unfinished tasks:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority unfinished tasks:")))
          (tags "customtag"
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Tasks marked with customtag:")))

          (agenda "")
          (alltodo "")))))
#+end_src

** Roam

#+begin_src emacs-lisp
;; (make-directory "~/org-roam")
(setq org-roam-directory (file-truename "~/org/roam/"))
#+end_src

* Treemacs Config

#+begin_src emacs-lisp
(map! :leader
      :desc "Toggle treemacs file viewer" "e e" #'treemacs)
#+end_src

* VTerm Config

#+begin_src emacs-lisp
(map! :leader
      :desc "Vterm popup toggle"     "v t" #'+vterm/toggle)
#+end_src
